In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
Customer_Acqusition= pd.read_csv('C:/Users/ZomAdmin/Desktop/New folder/New folder/Data Science with python/Python Session 5/Main case submission/4. Pandas Case Study 2 - Credit Card Case Study/Customer Acqusition.csv')
Repayment = pd.read_csv('C:/Users/ZomAdmin/Desktop/New folder/New folder/Data Science with python/Python Session 5/Main case submission/4. Pandas Case Study 2 - Credit Card Case Study/Repayment.csv')
spend = pd.read_csv('C:/Users/ZomAdmin/Desktop/New folder/New folder/Data Science with python/Python Session 5/Main case submission/4. Pandas Case Study 2 - Credit Card Case Study/spend.csv')

In [4]:
Customer_Acqusition.head(1)

   No Customer  Age       City Product     Limit Company        Segment
0   1       A1   76  BANGALORE    Gold  500000.0      C1  Self Employed

In [5]:
Repayment.head(1)

   SL No: Customer      Month     Amount  Unnamed: 4
0     NaN       A1  12-Jan-04  495414.75         NaN

In [7]:
Repayment.rename(columns={'Month':'repayment_month'},inplace = True)

In [8]:
Repayment.head(1)

   SL No: Customer repayment_month     Amount  Unnamed: 4
0     NaN       A1       12-Jan-04  495414.75         NaN

In [9]:
spend.head(1)

   Sl No: Customer      Month       Type    Amount
0       1       A1  12-Jan-04  JEWELLERY  485470.8

In [10]:
spend.rename(columns = {'Month':'spend_month'},inplace = True)

In [11]:
spend.head(1)

   Sl No: Customer spend_month       Type    Amount
0       1       A1   12-Jan-04  JEWELLERY  485470.8

In [12]:
map_mer = pd.merge(left = Customer_Acqusition,right = Repayment,how = 'left',left_on = 'Customer',right_on = 
        'Customer')

In [13]:
map_mer.head(1)

,No,Customer,Age,City,Product,Limit,Company,Segment,SL No:,repayment_month,Amount,Unnamed: 4
0,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,NaN,12-Jan-04,495414.75,NaN

In [16]:
final_data = pd.merge(left = map_mer , right = spend,how = 'left',left_on = 'Customer',right_on ='Customer' )

In [17]:
final_data.to_csv('final_datae.csv',header = True)

In [18]:
final_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 37284 entries, 0 to 37283
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   No               37284 non-null  int64
 1   Customer         37284 non-null  object
 2   Age              37284 non-null  int64
 3   City             37284 non-null  object
 4   Product          37284 non-null  object
 5   Limit            37284 non-null  float64
 6   Company          37284 non-null  object
 7   Segment          37284 non-null  object
 8   SL No:           37266 non-null  float64
 9   repayment_month  37284 non-null  object
 10  Amount_x         37284 non-null  float64
 11  Unnamed: 4       0 non-null      float64
 12  Sl No:           37284 non-null  int64
 13  spend_month      37284 non-null  object
 14  Type             37284 non-null  object
 15  Amount_y         37284 non-null  float64
dtypes: float64(5), int64(3), object(8)
memory usage: 4.8+ MB

In [ ]:
final_data.describe().T

In [ ]:
final_data.select_dtypes('object').describe().T

# a. In case age is less than 18, replace it with mean of age values.

In [ ]:
final_data.head(1)

In [ ]:
round(final_data.Age.mean(),0)

In [ ]:
final_data['Age'] = pd.Series(np.where(final_data.Age <18,round(final_data.Age.mean(),0),final_data.Age))

In [ ]:
final_data.head(1)

In [70]:
final_data.to_csv('final_datae.csv',header = True)